perf_test/results/optimized-read-v2.txt
ФАКТИЧЕСКИЙ РЕЗУЛЬТАТ
Дата: 2026-06-03
Сценарий: optimized-read-v2
Оптимизация: переписывание read-запроса в pagination-first форму
Команда: COUNT=5000 RATE=20 RESULT_PREFIX=optimized-read-v2 ./perf_test/scripts/run_read_test.sh

Requests      [total, rate, throughput]  5000, 20.00, 0.01
Duration      [total, attack, wait]      4m39.950555106s, 4m9.95023258s, 30.000322526s
Latencies     [mean, 50, 95, 99, max]    29.966801045s, 30.000631888s, 30.001296391s, 30.001732848s, 30.002455233s
Bytes In      [total, mean]              23618, 4.72
Bytes Out     [total, mean]              0, 0.00
Success       [ratio]                    0.04%
Status Codes  [code:count]               0:4998  200:2
Error Set:
context deadline exceeded / EOF для вариантов GET /api/events

Комментарий:
Переписывание запроса позволило получить первые успешные ответы, но при RATE=20
endpoint все еще насыщался и почти все запросы завершались timeout.