perf_test/results/optimized-read.txt
Дата: 2026-06-03
Сценарий: optimized-read
Оптимизация: индексы из db/migrations/0030_perf_event_indexes.up.sql
Команда: COUNT=5000 RATE=20 RESULT_PREFIX=optimized-read ./perf_test/scripts/run_read_test.sh

Requests      [total, rate, throughput]  5000, 20.00, 0.00
Duration      [total, attack, wait]      4m39.95140021s, 4m9.950580291s, 30.000819919s
Latencies     [mean, 50, 95, 99, max]    29.935932865s, 30.000629951s, 30.001310652s, 30.001711856s, 30.002416664s
Bytes In      [total, mean]              240, 0.05
Bytes Out     [total, mean]              0, 0.00
Success       [ratio]                    0.00%
Status Codes  [code:count]               0:4994  500:6
Error Set:
500 Internal Server Error
context deadline exceeded / EOF для вариантов GET /api/events

Комментарий:
Одних индексов оказалось недостаточно: endpoint все еще уходил в timeout при
той же нагрузке COUNT=5000 RATE=20.